recipe_box/app/controllers/recipes_controller.rb

	def index
		@recipe = Recipe.all.order("created_at DESC")
---
SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC

	def create
		@recipe = Recipe.new(recipe_params)

		if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "toto"], ["description", "c'est trop bon"], ["created_at", "2016-02-10 00:26:00.604326"], ["updated_at", "2016-02-10 00:26:00.604326"]]

	def update
		if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image_updated_at", "2016-02-10 16:29:49.269858"], ["image_file_name", "beouf-aux-oignons.jpg"], ["updated_at", "2016-02-10 16:29:50.794570"], ["id", 6]]