blog/app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "toto"], ["body", "C'est nulle\r\n"], ["post_id", 3], ["created_at", "2016-02-09 21:51:23.828635"], ["updated_at", "2016-02-09 21:51:23.828635"]]