blog/app/controllers/posts_controller.rb

	def update

			@post = Post.find(params[:id])

			if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Zidane sur Eden Hazard Dernière version"], ["updated_at", "2016-02-09 16:39:49.373228"], ["id", 3]]