sample_app/app/controllers/users_controller.rb

     def index
    @titre = "Tous les utilisateurs"
    @users = User.paginate(:page => params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

 def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("nom", "email", "salt", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)