My_pin/app/controllers/pins_controller.rb

	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Another test pin"], ["description", "epirfve[inv[ein"], ["user_id", 1], ["created_at", "2016-02-15 21:10:30.809488"], ["updated_at", "2016-02-15 21:10:30.809488"]]

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["image_file_name", "images.jpeg"], ["image_file_size", 13589], ["image_updated_at", "2016-02-16 23:57:41.277349"], ["updated_at", "2016-02-16 23:57:41.354565"], ["id", 4]]

	def find_param
		@pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 8]]